000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыОперацийСчетНаОплатуПокупателю/ВидыОперацийСчетНаОплатуПокупателю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСчетНаОплатуПокупателю</name>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
  <enumValues>
    <name>ОплатаЧастями</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатаЧастями</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыУслугБанка/ТипыУслугБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУслугБанка</name>
  <enumValues>
    <name>ОплатаЧастями</name>
  </enumValues>
  <enumValues>
    <name>МгновеннаяРассрочка</name>
  </enumValues>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
  <enumValues>
    <name>ПакетМалыша</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ОбменСБанкамиПовтИсп/Module.bsl
#Область ОбщийИнтерфейс

Функция ПолучитьДанныеПрограммы(КредитнаяПрограмма)	Экспорт

	Возврат ОбменСБанкамиСервер.ПолучитьДанныеПрограммы(КредитнаяПрограмма);

КонецФункции

Функция ТипыУслугБанкаВидамОперацииСчетуНаОплатуПокупателю(ТипУслугиИлиОперация)	Экспорт

	ТипыПоОперации = Новый Соответствие;
	ТипыПоОперации.Вставить(Перечисления.ВидыОперацийСчетНаОплатуПокупателю.Кредит, Перечисления.ТипыУслугБанка.Кредит);
	ТипыПоОперации.Вставить(Перечисления.ВидыОперацийСчетНаОплатуПокупателю.ОплатаЧастями, Перечисления.ТипыУслугБанка.ОплатаЧастями);

	Значение = ТипыПоОперации.Получить(ТипУслугиИлиОперация);

	Если Значение = Неопределено Тогда

		ОперацииПоТипу = Новый Соответствие;

		Для каждого КлючЗначение Из ТипыПоОперации Цикл
			
			ОперацииПоТипу.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);

		КонецЦикла;

		Значение = ОперацииПоТипу.Получить(ТипУслугиИлиОперация);

	КонецЕсли;

	Возврат Значение;

КонецФункции

#КонецОбласти
